
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ТоварыВРезерве.Записать();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ТоварыВРезервеОстатки.Товар КАК Товар,
	                      |	ТоварыВРезервеОстатки.ДокументРезерва КАК ДокументРезерва,
	                      |	ТоварыВРезервеОстатки.КоличествоОстаток КАК Остаток
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыВРезерве.Остатки(&МоментВремени, &Условие) КАК ТоварыВРезервеОстатки");		   
	Если ЗначениеЗаполнено(ДокументРезерва) Тогда
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", "Покупатель = &Покупатель И ДокументРезерва = &ДокументРезерва");
		Запрос.УстановитьПараметр("ДокументРезерва", ДокументРезерва);
	Иначе
		Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", "Покупатель = &Покупатель");
	КонецЕсли;	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Покупатель", Покупатель);
	СписокДокументовРезерва = Запрос.Выполнить().Выбрать();
	
	Движения.ТоварыВРезерве.Записывать = Истина;
	Пока СписокДокументовРезерва.Следующий() Цикл
		Движение = Движения.ТоварыВРезерве.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = СписокДокументовРезерва.Товар;
		Движение.Покупатель = Покупатель;
		Движение.ДокументРезерва = СписокДокументовРезерва.ДокументРезерва;
		Движение.Количество = СписокДокументовРезерва.Остаток;
	КонецЦикла;
КонецПроцедуры;