
Процедура ОбработкаПроведения(Отказ, Режим)
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПродажаТовараТовары.Товар КАК Товар,
	               |	СУММА(ПродажаТовараТовары.Количество) КАК Количество,
	               |	ПродажаТовараТовары.СрокГодности КАК СрокГодности,
	               |	СУММА(ПродажаТовараТовары.Сумма) КАК Сумма
	               |ПОМЕСТИТЬ ВТ_ТекущийДокумент
	               |ИЗ
	               |	Документ.ПродажаТовара.Товары КАК ПродажаТовараТовары
	               |ГДЕ
	               |	ПродажаТовараТовары.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПродажаТовараТовары.Товар,
	               |	ПродажаТовараТовары.СрокГодности
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТекущийДокумент.Товар КАК Товар,
	               |	ВТ_ТекущийДокумент.Количество КАК Количество,
	               |	ВТ_ТекущийДокумент.СрокГодности КАК ЖелаемыйСрокГодности,
	               |	ВТ_ТекущийДокумент.Сумма КАК Сумма,
	               |	ЕСТЬNULL(ОстаткиТовараОстатки.ОстаткиОстаток, 0) КАК Остаток,
	               |	ОстаткиТовараОстатки.СрокГодности КАК СрокГодности
	               |ИЗ
	               |	ВТ_ТекущийДокумент КАК ВТ_ТекущийДокумент
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТовара.Остатки(
	               |				&МоментВремени,
	               |				Товар В
	               |					(ВЫБРАТЬ
	               |						ВТ.Товар
	               |					ИЗ
	               |						ВТ_ТекущийДокумент КАК ВТ)) КАК ОстаткиТовараОстатки
	               |		ПО ВТ_ТекущийДокумент.Товар = ОстаткиТовараОстатки.Товар";
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());	  
	
	ПозицииДокумента = Запрос.Выполнить().Выгрузить();
	Отбор = Новый Структура();
	Отбор.Вставить("");
	ПозицииДокумента.НайтиСтроки(Отбор);
	Движения.ОстаткиТовара.Записывать = Истина;
	Пока ПозицииДокумента.Следующий() Цикл
		АктуальныйОстаток = ПозицииДокумента.Остаток - ПозицииДокумента.Количество;
		
		Если АктуальныйОстаток < 0 Тогда 
			Отказ = Истина;
			Сообщить(СтрШаблон("Не хватает %1 шт. %2 в партии от %3", -АктуальныйОстаток, 
				ПозицииДокумента.Товар, ПозицииДокумента.СрокГодности));
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.ОстаткиТовара.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = ПозицииДокумента.Товар;
		Движение.Партия = ПозицииДокумента.СрокГодности;
		Движение.Остатки = ПозицииДокумента.Количество;
	КонецЦикла;
КонецПроцедуры
