
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиТоваров Приход
	Движения.ОстаткиТоваров.Записывать = Истина;         
	НаборЗаписейЦен = РегистрыСведений.ЦеныТоваров.СоздатьНаборЗаписей();
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТовары.Товар;
		Движение.Количество = ТекСтрокаТовары.Количество;
		
		НоваяЗапись = НаборЗаписейЦен.Добавить();
		НоваяЗапись.Период = Дата;
		НоваяЗапись.Товар = ТекСтрокаТовары.Товар;
		НоваяЗапись.Цена = ТекСтрокаТовары.Цена;
	КонецЦикла;

	НаборЗаписейЦен.Записать(РежимЗамещения.Слияние);
	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
