
&НаКлиенте
Процедура ТоварыТоварПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущаяСтрока <> Неопределено Тогда		
		ТекущаяСтрока.Цена = ЦенообразованиеСервер.ПолучитьЦенуТовараНаСервере(ТекущаяСтрока.Товар, Объект.Дата);
		ТекущаяСтрока.Сумма = Окр(ТекущаяСтрока.Цена * ТекущаяСтрока.Количество, 2);
	КонецЕсли;
КонецПроцедуры  

&НаКлиенте
Процедура ТоварыПартияНачалоВыбора(Элемент, ДанныеВыбора, ВыборДобавлением, СтандартнаяОбработка) 
	СтандартнаяОбработка = Ложь;
	ТекущаяСтрока = Элементы.Товары.ТекущиеДанные;
	
	Если ТекущаяСтрока = Неопределено Или Не ЗначениеЗаполнено(ТекущаяСтрока.Товар) Тогда 
		Предупреждение("Сначала выберите товар!");
		Возврат;
	КонецЕсли;
		
	ДанныеВыбора = ПартийныйУчетСервер.ПолучитьСписокПартийТовара(Элементы.Товары.ТекущиеДанные.Товар, Объект.Дата);	
КонецПроцедуры


