
функция ПолучитьСписокПартийТовара(Товар, Дата) Экспорт
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ОстаткиТовараОстатки.СрокГодности КАК СрокГодности
	               |ИЗ
	               |	РегистрНакопления.ОстаткиТовара.Остатки(&Дата, Товар = &Товар) КАК ОстаткиТовараОстатки";
	Запрос.УстановитьПараметр("Дата", Дата);
	Запрос.УстановитьПараметр("Товар", Товар);
	МассивПартий = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("СрокГодности");
	
	СписокПартий = Новый СписокЗначений;
	
	Для Каждого Партия Из МассивПартий Цикл
		СписокПартий.Добавить(Партия);
	КонецЦикла;	
	
	Возврат СписокПартий;
КонецФункции