
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиВещей Приход
	Движения.ОстаткиВещей.Записывать = Истина;
	Для Каждого ТекСтрокаСоставДокумента Из СоставДокумента Цикл
		Движение = Движения.ОстаткиВещей.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Вещь = ТекСтрокаСоставДокумента.Вещь;
		Движение.Количество = ТекСтрокаСоставДокумента.Количество;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
