&НаСервере
Процедура ОбновитьНайденныеТоварыНаСервере()
	НайденныеТовары.Очистить();
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	Товар.Ссылка КАК Лекарство
	                      |ПОМЕСТИТЬ ВТ_НайденныеЛекарства
	                      |ИЗ
	                      |	Справочник.Товар КАК Товар
	                      |ГДЕ
	                      |	&Условие
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТоварАналоги.Аналог КАК Лекарство
	                      |ПОМЕСТИТЬ ВТ_ЛекарстваИАналоги
	                      |ИЗ
	                      |	Справочник.Товар.Аналоги КАК ТоварАналоги
	                      |ГДЕ
	                      |	ТоварАналоги.Ссылка В
	                      |			(ВЫБРАТЬ
	                      |				ВТ.Лекарство
	                      |			ИЗ
	                      |				ВТ_НайденныеЛекарства КАК ВТ)
	                      |
	                      |ОБЪЕДИНИТЬ ВСЕ
	                      |
	                      |ВЫБРАТЬ
	                      |	ВТ_НайденныеЛекарства.Лекарство
	                      |ИЗ
	                      |	ВТ_НайденныеЛекарства КАК ВТ_НайденныеЛекарства
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_ЛекарстваИАналоги.Лекарство КАК Лекарство,
	                      |	ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0) КАК Остаток,
	                      |	ЕСТЬNULL(ЦеныТоваровСрезПоследних.Цена, 0) КАК Стоимость
	                      |ИЗ
	                      |	РегистрНакопления.ОстаткиТоваров.Остатки(
	                      |			&МоментВремени,
	                      |			Товар В
	                      |				(ВЫБРАТЬ
	                      |					ВТ.Лекарство
	                      |				ИЗ
	                      |					ВТ_ЛекарстваИАналоги КАК ВТ)) КАК ОстаткиТоваровОстатки
	                      |		ПРАВОЕ СОЕДИНЕНИЕ РегистрСведений.ЦеныТоваров.СрезПоследних(
	                      |				&МоментВремени,
	                      |				Товар В
	                      |					(ВЫБРАТЬ
	                      |						ВТ.Лекарство
	                      |					ИЗ
	                      |						ВТ_ЛекарстваИАналоги КАК ВТ)) КАК ЦеныТоваровСрезПоследних
	                      |			ПРАВОЕ СОЕДИНЕНИЕ ВТ_ЛекарстваИАналоги КАК ВТ_ЛекарстваИАналоги
	                      |			ПО ВТ_ЛекарстваИАналоги.Лекарство = ЦеныТоваровСрезПоследних.Товар
	                      |		ПО ВТ_ЛекарстваИАналоги.Лекарство = ОстаткиТоваровОстатки.Товар");
	
	Запрос.УстановитьПараметр("МоментВремени", ТекущаяДатаСеанса());
	
	МассивУсловий = Новый Массив;	
	Если ЗначениеЗаполнено(НаименованиеПрепарата) Тогда
		МассивУсловий.Добавить("Товар.Ссылка = &НаименованиеПрепарата");
		Запрос.УстановитьПараметр("НаименованиеПрепарата", НаименованиеПрепарата);
	КонецЕсли;
	Если ЗначениеЗаполнено(Назначение) Тогда
		МассивУсловий.Добавить("Товар.Ссылка В (ВЫБРАТЬ
							|	ЗначенияСвойствЛекарств.Лекарство КАК Лекарство
							|ИЗ
							|	РегистрСведений.ЗначенияСвойствЛекарств КАК ЗначенияСвойствЛекарств
							|ГДЕ
							|	ЗначенияСвойствЛекарств.Значение = &Назначение)");
		Запрос.УстановитьПараметр("Назначение", Назначение);
	КонецЕсли;   
	Если ЗначениеЗаполнено(ДействующееВещество) Тогда
		МассивУсловий.Добавить("Товар.Ссылка В (ВЫБРАТЬ
							|	ЗначенияСвойствЛекарств.Лекарство КАК Лекарство
							|ИЗ
							|	РегистрСведений.ЗначенияСвойствЛекарств КАК ЗначенияСвойствЛекарств
							|ГДЕ
							|	ЗначенияСвойствЛекарств.Значение = &ДействующееВещество)");
		Запрос.УстановитьПараметр("ДействующееВещество", ДействующееВещество);
	КонецЕсли;
	
	Если МассивУсловий.Количество() = 0 Тогда
		Возврат;	
	КонецЕсли;
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "&Условие", СтрСоединить(МассивУсловий, " И "));  
	
	Выборка = Запрос.Выполнить().Выбрать(); 
		
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = НайденныеТовары.Добавить();
		НоваяСтрока.Препарат = Выборка.Лекарство;
		НоваяСтрока.Остаток = Выборка.Остаток;
		НоваяСтрока.Стоимость = Выборка.Стоимость;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура РасчитатьИтог()
	Элементы.ВыбранныеТоварыСумма.ТекстПодвала = Формат(ВыбранныеТовары.Итог("Сумма"), "ЧЦ=10; ЧДЦ=2");
КонецПроцедуры

&НаКлиенте
Процедура НаименованиеПрепаратаПриИзменении(Элемент)
	ОбновитьНайденныеТоварыНаСервере();
КонецПроцедуры     

&НаКлиенте
Процедура НазначениеПриИзменении(Элемент)
	ОбновитьНайденныеТоварыНаСервере();
КонецПроцедуры

&НаКлиенте
Процедура ДействующееВеществоПриИзменении(Элемент)
	ОбновитьНайденныеТоварыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ВыбранныеТоварыПеретаскиваниеНаСервере(Товары)	
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЦеныТоваровСрезПоследних.Товар КАК Товар,
	                      |	ЦеныТоваровСрезПоследних.Цена КАК Цена
	                      |ИЗ
	                      |	РегистрСведений.ЦеныТоваров.СрезПоследних КАК ЦеныТоваровСрезПоследних
	                      |ГДЕ
	                      |	ЦеныТоваровСрезПоследних.Товар В (&Товары)"); 
	
	Запрос.УстановитьПараметр("Товары", Товары);
	
	СписокТоваров = Запрос.Выполнить().Выбрать();
	
	Если СписокТоваров.Количество() < Товары.Количество() Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Выбраны товары для которых не установлена цена! Такие товары добавлены не будут.";
		Сообщение.Сообщить();
	КонецЕсли;
	
	Пока СписокТоваров.Следующий() Цикл
    	НоваяСтрока = ВыбранныеТовары.Добавить();
		НоваяСтрока.Препарат = СписокТоваров.Товар;
		НоваяСтрока.Количество = 1;
		НоваяСтрока.Цена = СписокТоваров.Цена;
		НоваяСтрока.Сумма = СписокТоваров.Цена;
	КонецЦикла;
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеТоварыПеретаскивание(Элемент, ПараметрыПеретаскивания, СтандартнаяОбработка, Строка, Поле)
	СтандартнаяОбработка = Ложь;
	
	МассивТоваров = Новый Массив;	
	Для Каждого Стр Из ПараметрыПеретаскивания.Значение Цикл
		МассивТоваров.Добавить(Стр.Препарат);	
	КонецЦикла;
	
	ВыбранныеТоварыПеретаскиваниеНаСервере(МассивТоваров); 
	
	РасчитатьИтог()
КонецПроцедуры

&НаКлиенте
Процедура ВыбранныеТоварыКоличествоПриИзменении(Элемент)
	 ТекСтр = Элементы.ВыбранныеТовары.ТекущиеДанные;
	 
	 Если ТекСтр <> Неопределено Тогда
		ТекСтр.Сумма = ТекСтр.Цена * ТекСтр.Количество; 
		
		РасчитатьИтог()
	 КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОформитьПродажуНаСервере()
    Продажа = Документы.ПродажаТоваров.СоздатьДокумент();
	Продажа.Дата = ТекущаяДатаСеанса();
	
	Для Каждого Стр Из ВыбранныеТовары Цикл
		НоваяСтрока = Продажа.Товары.Добавить();		
		НоваяСтрока.Товар = Стр.Препарат;  
		НоваяСтрока.Количество = Стр.Количество;
		НоваяСтрока.Цена = Стр.Цена;	
	КонецЦикла;
	
	Продажа.Записать(РежимЗаписиДокумента.Проведение);
	
	ВыбранныеТовары.Очистить();
КонецПроцедуры

&НаКлиенте
Процедура ОформитьПродажу(Команда)
	ОформитьПродажуНаСервере();
КонецПроцедуры


