
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ВзаиморасчетыСКлиентами.Записывать = Истина;
	Проводка = Движения.ВзаиморасчетыСКлиентами.Добавить();
	Проводка.Период = Дата;
	Проводка.СчетДт = ПланыСчетов.Основной.Покупатели;    
	Проводка.СчетКт = ПланыСчетов.Основной.ПрибылиИУбытки;
	Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоВзаиморасчетыСКлиентами.Договоры] = Договор;
	Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоВзаиморасчетыСКлиентами.Контрагенты] = Покупатель; 
	Проводка.Сумма = Сумма;
КонецПроцедуры
