
Процедура ОбработкаПроведения(Отказ, Режим)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	КурсыВалютАкта.Курс КАК КурсАкта,
	                      |	КурсыВалютОрдера.Курс КАК КурсОрдера
	                      |ИЗ
	                      |	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаОрдера) КАК КурсыВалютОрдера
	                      |		ПО ПриходныйКассовыйОрдер.Валюта = КурсыВалютОрдера.Валюта
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КурсыВалют.СрезПоследних(&МоментВремени, Валюта = &ВалютаАкта) КАК КурсыВалютАкта
	                      |		ПО ПриходныйКассовыйОрдер.Акт.Валюта = КурсыВалютАкта.Валюта
	                      |ГДЕ
	                      |	ПриходныйКассовыйОрдер.Ссылка = &Ссылка");
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("ВалютаОрдера", Валюта);
	Запрос.УстановитьПараметр("ВалютаАкта", Акт.Валюта);
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	КурсыВалют = Запрос.Выполнить().Выбрать();
	КурсыВалют.Следующий();
	Если Не (ЗначениеЗаполнено(КурсыВалют.КурсОрдера) И ЗначениеЗаполнено(КурсыВалют.КурсАкта)) Тогда
		Отказ = Истина;
		Сообщить("Нет актуального курса для валюты акта или ордера!");
	Иначе	
		СуммаВВалютеАкта = Сумма * КурсыВалют.КурсОрдера / КурсыВалют.КурсАкта;  
			
		Движения.ДебиторскиеЗадолженности.Записывать = Истина;
		Движение = Движения.ДебиторскиеЗадолженности.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Акт = Акт;
		Движение.Валюта = Акт.Валюта;
		Движение.Покупатель = Акт.Покупатель;
		Движение.Сумма = СуммаВВалютеАкта;  
	КонецЕсли;
КонецПроцедуры
