
Процедура ОбработкаПроведения(Отказ, Режим)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РезервированиеТовараТовары.Товар КАК Товар,
	                      |	СУММА(РезервированиеТовараТовары.Количество) КАК Количество
	                      |ПОМЕСТИТЬ ВТ_ТекущийДокумент
	                      |ИЗ
	                      |	Документ.РезервированиеТовара.Товары КАК РезервированиеТовараТовары
	                      |ГДЕ
	                      |	РезервированиеТовараТовары.Ссылка = &Ссылка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	РезервированиеТовараТовары.Товар
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_ТекущийДокумент.Товар КАК Товар,
	                      |	СУММА(ВТ_ТекущийДокумент.Количество) КАК Количество,
	                      |	СУММА(ЕСТЬNULL(ОстатакиТовараОстатки.КоличествоОстаток, 0)) КАК Остаток,
	                      |	СУММА(ЕСТЬNULL(ТоварыВРезервеОстатки.КоличествоОстаток, 0)) КАК ВРезерве
	                      |ИЗ
	                      |	ВТ_ТекущийДокумент КАК ВТ_ТекущийДокумент
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстатакиТовара.Остатки(&МоментВремени, ) КАК ОстатакиТовараОстатки
	                      |		ПО ВТ_ТекущийДокумент.Товар = ОстатакиТовараОстатки.Товар
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ТоварыВРезерве.Остатки(&МоментВремени, ) КАК ТоварыВРезервеОстатки
	                      |		ПО ВТ_ТекущийДокумент.Товар = ТоварыВРезервеОстатки.Товар
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВТ_ТекущийДокумент.Товар");
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	СписокТоваров = Запрос.Выполнить().Выбрать();
	
	Движения.ТоварыВРезерве.Записывать = Истина;
	
	Пока СписокТоваров.Следующий() Цикл
		СвободныйОстаток = СписокТоваров.Остаток - СписокТоваров.ВРезерве;
		
		Если СписокТоваров.Количество > СвободныйОстаток Тогда
			Отказ = Истина;
			Сообщить(СтрШаблон("Не хватате товара %1! Остаток на складе: %2.", СписокТоваров.Товар, СвободныйОстаток));
		КонецЕсли;
		
		Движение = Движения.ТоварыВРезерве.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Товар = СписокТоваров.Товар;
		Движение.Покупатель = Покупатель;
		Движение.Количество = СписокТоваров.Количество;
	КонецЦикла;
КонецПроцедуры
