
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ОстаткиТоваров.Очистить();
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.ОстаткиТоваров.Записать();          
	
	Движения.Продажи.Очистить();  
	Движения.Продажи.Записывать = Истина;
	Движения.Продажи.Записать();
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	РасходнаяНакладнаяСостав.Номенклатура КАК Номенклатура,
	               |	РасходнаяНакладнаяСостав.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	               |	РасходнаяНакладнаяСостав.Партия КАК Партия,
	               |	СУММА(РасходнаяНакладнаяСостав.Количество) КАК Количество,
	               |	СУММА(РасходнаяНакладнаяСостав.Сумма) КАК Сумма,
	               |	МИНИМУМ(РасходнаяНакладнаяСостав.НомерСтроки) КАК НомерСтроки
	               |ПОМЕСТИТЬ ВТ_ВыбраннаяНоменклатура
	               |ИЗ
	               |	Документ.РасходнаяНакладная.Состав КАК РасходнаяНакладнаяСостав
	               |ГДЕ
	               |	РасходнаяНакладнаяСостав.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	РасходнаяНакладнаяСостав.Номенклатура,
	               |	РасходнаяНакладнаяСостав.Партия,
	               |	РасходнаяНакладнаяСостав.Номенклатура.ВидНоменклатуры
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ВыбраннаяНоменклатура.НомерСтроки КАК НомерСтроки,
	               |	ВТ_ВыбраннаяНоменклатура.Номенклатура КАК Номенклатура,
	               |	ВТ_ВыбраннаяНоменклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	               |	ВТ_ВыбраннаяНоменклатура.Партия КАК Партия,
	               |	ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0) КАК Остаток,
	               |	ЕСТЬNULL(ОстаткиТоваровОстатки.СтоимостьОстаток, 0) КАК Себестоимость,
	               |	ВТ_ВыбраннаяНоменклатура.Количество КАК Количество,
	               |	ВТ_ВыбраннаяНоменклатура.Сумма КАК Сумма
	               |ИЗ
	               |	ВТ_ВыбраннаяНоменклатура КАК ВТ_ВыбраннаяНоменклатура
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(
	               |				&МоментВремени,
	               |				(Товар, Партия) В
	               |					(ВЫБРАТЬ
	               |						ВТ.Номенклатура,
	               |						ВТ.Партия
	               |					ИЗ
	               |						ВТ_ВыбраннаяНоменклатура КАК ВТ)) КАК ОстаткиТоваровОстатки
	               |		ПО ВТ_ВыбраннаяНоменклатура.Номенклатура = ОстаткиТоваровОстатки.Товар
	               |			И ВТ_ВыбраннаяНоменклатура.Партия = ОстаткиТоваровОстатки.Партия";      
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());     
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Отказ = Истина;
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Документ не заполнен!";
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;  
	
	ВыборкаНоменклатуры = РезультатЗапроса.Выбрать();
	Пока ВыборкаНоменклатуры.Следующий() Цикл
		СтоимостьПроданного = 0;
		
		Если ВыборкаНоменклатуры.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Товар Тогда
			
			Если Не ЗначениеЗаполнено(ВыборкаНоменклатуры.Партия) Тогда
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю;            
				Сообщение.Текст = СтрШаблон("Не указана партия у товара %1 в строке %2", ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.НомерСтроки);
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Поле = СтрШаблон("Состав[%1].Партия", ВыборкаНоменклатуры.НомерСтроки - 1);
				Сообщение.Сообщить();
				Продолжить;
			КонецЕсли;
			
			РазницаКоличествоОстаток = ВыборкаНоменклатуры.Количество - ВыборкаНоменклатуры.Остаток;
			Если РазницаКоличествоОстаток > 0 Тогда
				Отказ = Истина;
				Сообщение = Новый СообщениеПользователю;
				Сообщение.Текст = СтрШаблон("Не хватает %1 шт. товара %2 в партии %3", РазницаКоличествоОстаток, ВыборкаНоменклатуры.Номенклатура, ВыборкаНоменклатуры.Партия);
				Сообщение.Сообщить();
				Продолжить;
			КонецЕсли;
			
			КоличествоСписанного = ВыборкаНоменклатуры.Количество;
			СтоимостьПроданного = ВыборкаНоменклатуры.Себестоимость;
			Если Не РазницаКоличествоОстаток = 0 Тогда 
				СебестоимостьЕдиницы = ВыборкаНоменклатуры.Себестоимость / ВыборкаНоменклатуры.Остаток;
				СтоимостьПроданного = СебестоимостьЕдиницы * КоличествоСписанного; 
			КонецЕсли;  
			
			ДвижениеОстатки = Движения.ОстаткиТоваров.Добавить(); 
			ДвижениеОстатки.ВидДвижения = ВидДвиженияНакопления.Расход;
			ДвижениеОстатки.Период = Дата;
			ДвижениеОстатки.Товар = ВыборкаНоменклатуры.Номенклатура;
			ДвижениеОстатки.Партия = ВыборкаНоменклатуры.Партия;
			ДвижениеОстатки.Количество = КоличествоСписанного; 
			ДвижениеОстатки.Стоимость = СтоимостьПроданного;

		КонецЕсли;

		
		ДвижениеПродажи = Движения.Продажи.Добавить(); 
		ДвижениеПродажи.Период = Дата;
		ДвижениеПродажи.Номенклатура = ВыборкаНоменклатуры.Номенклатура;
		ДвижениеПродажи.Количество = ВыборкаНоменклатуры.Количество; 
		ДвижениеПродажи.Себестоимость = СтоимостьПроданного;
		ДвижениеПродажи.СуммаПродаж = ВыборкаНоменклатуры.Сумма;
	КонецЦикла;
КонецПроцедуры      
