
Процедура ОбработкаПроведения(Отказ, Режим)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПродажаТовараТовары.Товар КАК Товар,
	                      |	СУММА(ПродажаТовараТовары.Количество) КАК Количество
	                      |ПОМЕСТИТЬ ВТ_ТекущийДокумент
	                      |ИЗ
	                      |	Документ.ПродажаТовара.Товары КАК ПродажаТовараТовары
	                      |ГДЕ
	                      |	ПродажаТовараТовары.Ссылка = &Ссылка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ПродажаТовараТовары.Товар
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТоварыВРезервеОстатки.Товар КАК Товар,
	                      |	СУММА(ТоварыВРезервеОстатки.КоличествоОстаток) КАК СуммарныйРезерв
	                      |ПОМЕСТИТЬ ВТ_СуммарныйРезерв
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыВРезерве.Остатки(
	                      |			&МоментВремени,
	                      |			Товар В
	                      |				(ВЫБРАТЬ
	                      |					ВТ.Товар
	                      |				ИЗ
	                      |					ВТ_ТекущийДокумент КАК ВТ)) КАК ТоварыВРезервеОстатки
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТоварыВРезервеОстатки.Товар
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТоварыВРезервеОстатки.Товар КАК Товар,
	                      |	ТоварыВРезервеОстатки.КоличествоОстаток КАК РезервПокупателя,
	                      |	ТоварыВРезервеОстатки.ДокументРезерва КАК ДокументРезерва
	                      |ПОМЕСТИТЬ ВТ_РезервыПокупателя
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыВРезерве.Остатки(
	                      |			&МоментВремени,
	                      |			Покупатель = &Покупатель
	                      |				И Товар В
	                      |					(ВЫБРАТЬ
	                      |						ВТ.Товар
	                      |					ИЗ
	                      |						ВТ_ТекущийДокумент КАК ВТ)) КАК ТоварыВРезервеОстатки
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_ТекущийДокумент.Товар КАК Товар,
	                      |	ВТ_ТекущийДокумент.Количество КАК Требуется,
	                      |	ЕСТЬNULL(ВТ_СуммарныйРезерв.СуммарныйРезерв, 0) КАК СуммарныйРезерв,
	                      |	ЕСТЬNULL(ОстатакиТовараОстатки.КоличествоОстаток, 0) КАК Остаток,
	                      |	ЕСТЬNULL(ВТ_РезервыПокупателя.РезервПокупателя, 0) КАК РезервПокупателя,
	                      |	ВТ_РезервыПокупателя.ДокументРезерва КАК ДокументРезерва
	                      |ИЗ
	                      |	ВТ_ТекущийДокумент КАК ВТ_ТекущийДокумент
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстатакиТовара.Остатки(
	                      |				&МоментВремени,
	                      |				Товар В
	                      |					(ВЫБРАТЬ
	                      |						ВТ.Товар
	                      |					ИЗ
	                      |						ВТ_ТекущийДокумент КАК ВТ)) КАК ОстатакиТовараОстатки
	                      |		ПО ВТ_ТекущийДокумент.Товар = ОстатакиТовараОстатки.Товар
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммарныйРезерв КАК ВТ_СуммарныйРезерв
	                      |		ПО ВТ_ТекущийДокумент.Товар = ВТ_СуммарныйРезерв.Товар
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РезервыПокупателя КАК ВТ_РезервыПокупателя
	                      |		ПО ВТ_ТекущийДокумент.Товар = ВТ_РезервыПокупателя.Товар
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	ВТ_РезервыПокупателя.ДокументРезерва.МоментВремени
	                      |ИТОГИ
	                      |	МАКСИМУМ(Требуется),
	                      |	МАКСИМУМ(СуммарныйРезерв),
	                      |	МАКСИМУМ(Остаток),
	                      |	СУММА(РезервПокупателя)
	                      |ПО
	                      |	Товар");  
		
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Покупатель", Покупатель);
	ИтогиПоТоварам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Движения.ТоварыВРезерве.Записывать = Истина;
	Движения.ОстатакиТовара.Записывать = Истина;
	
	Пока ИтогиПоТоварам.Следующий() Цикл
		ОсталосьСписать = ИтогиПоТоварам.Требуется; 
		
		ДоступныйОстаток = ИтогиПоТоварам.Остаток - ИтогиПоТоварам.СуммарныйРезерв + ИтогиПоТоварам.РезервПокупателя; 
		Если ОсталосьСписать > ДоступныйОстаток Тогда
			Отказ = Истина;
			Сообщить(СтрШаблон("Не хватате товара %1! Доступный остаток на складе: %2.", 
				ИтогиПоТоварам.Товар, ДоступныйОстаток));
			Продолжить;
		КонецЕсли;
		
		СписокРезервовПокупателя = ИтогиПоТоварам.Выбрать();
		Пока СписокРезервовПокупателя.Следующий() Цикл
			СписаноСРезерва = Мин(СписокРезервовПокупателя.РезервПокупателя, ОсталосьСписать); 
			ОсталосьСписать = ОсталосьСписать - СписаноСРезерва;
			
			Если СписаноСРезерва = 0 Тогда
				Прервать;
			КонецЕсли; 
			
			Движение = Движения.ТоварыВРезерве.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Товар = СписокРезервовПокупателя.Товар;
			Движение.Покупатель = Покупатель;
			Движение.ДокументРезерва = СписокРезервовПокупателя.ДокументРезерва;
			Движение.Количество = СписаноСРезерва;
		КонецЦикла;
		
		Движение = Движения.ОстатакиТовара.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = ИтогиПоТоварам.Товар;
		Движение.Количество = ИтогиПоТоварам.Требуется;
	КонецЦикла;
КонецПроцедуры
