
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр ОстаткиТоваров Приход
	Движения.ОстаткиТоваров.Очистить();
	Движения.ОстаткиТоваров.Записывать = Истина;  
	Движения.ОстаткиТоваров.Записать();
	Для Каждого ТекСтрокаСостав Из Состав Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;     
		Движение.Партия = Ссылка;
		Движение.Товар = ТекСтрокаСостав.Номенклатура;
		Движение.Количество = ТекСтрокаСостав.Количество;
		Движение.Стоимость = ТекСтрокаСостав.Сумма;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
