
Процедура ОбработкаПроведения(Отказ, Режим)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПродажаТовараТовары.Товар КАК Товар,
	                      |	СУММА(ПродажаТовараТовары.Количество) КАК Количество
	                      |ПОМЕСТИТЬ ВТ_ТекущийДокумент
	                      |ИЗ
	                      |	Документ.ПродажаТовара.Товары КАК ПродажаТовараТовары
	                      |ГДЕ
	                      |	ПродажаТовараТовары.Ссылка = &Ссылка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ПродажаТовараТовары.Товар
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТоварыВРезервеОстатки.Товар КАК Товар,
	                      |	СУММА(ТоварыВРезервеОстатки.КоличествоОстаток) КАК СуммарныйРезерв
	                      |ПОМЕСТИТЬ ВТ_СуммарныйРезерв
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыВРезерве.Остатки(
	                      |			&МоментВремени,
	                      |			Товар В
	                      |				(ВЫБРАТЬ
	                      |					ВТ.Товар
	                      |				ИЗ
	                      |					ВТ_ТекущийДокумент КАК ВТ)) КАК ТоварыВРезервеОстатки
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТоварыВРезервеОстатки.Товар
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ТоварыВРезервеОстатки.Товар КАК Товар,
	                      |	СУММА(ТоварыВРезервеОстатки.КоличествоОстаток) КАК РезервПокупателя
	                      |ПОМЕСТИТЬ ВТ_РезервПокупателя
	                      |ИЗ
	                      |	РегистрНакопления.ТоварыВРезерве.Остатки(
	                      |			&МоментВремени,
	                      |			Покупатель = &Покупатель
	                      |				И Товар В
	                      |					(ВЫБРАТЬ
	                      |						ВТ.Товар
	                      |					ИЗ
	                      |						ВТ_ТекущийДокумент КАК ВТ)) КАК ТоварыВРезервеОстатки
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ТоварыВРезервеОстатки.Товар
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_ТекущийДокумент.Товар КАК Товар,
	                      |	ВТ_ТекущийДокумент.Количество КАК Требуется,
	                      |	ЕСТЬNULL(ВТ_РезервПокупателя.РезервПокупателя, 0) КАК РезервПокупателя,
	                      |	ЕСТЬNULL(ВТ_СуммарныйРезерв.СуммарныйРезерв, 0) КАК СуммарныйРезерв,
	                      |	ЕСТЬNULL(ОстатакиТовараОстатки.КоличествоОстаток, 0) КАК Остаток
	                      |ИЗ
	                      |	ВТ_ТекущийДокумент КАК ВТ_ТекущийДокумент
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстатакиТовара.Остатки(
	                      |				&МоментВремени,
	                      |				Товар В
	                      |					(ВЫБРАТЬ
	                      |						ВТ.Товар
	                      |					ИЗ
	                      |						ВТ_ТекущийДокумент КАК ВТ)) КАК ОстатакиТовараОстатки
	                      |		ПО ВТ_ТекущийДокумент.Товар = ОстатакиТовараОстатки.Товар
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_СуммарныйРезерв КАК ВТ_СуммарныйРезерв
	                      |		ПО ВТ_ТекущийДокумент.Товар = ВТ_СуммарныйРезерв.Товар
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТ_РезервПокупателя КАК ВТ_РезервПокупателя
	                      |		ПО ВТ_ТекущийДокумент.Товар = ВТ_РезервПокупателя.Товар");  
		
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Покупатель", Покупатель);
	ВыборкаПоТоварам = Запрос.Выполнить().Выбрать();
	
	Движения.ТоварыВРезерве.Записывать = Истина;
	Движения.ОстатакиТовара.Записывать = Истина;
	
	Пока ВыборкаПоТоварам.Следующий() Цикл
		ОсталосьСписать = ВыборкаПоТоварам.Требуется;
		СписаноСРезерва = Мин(ОсталосьСписать, ВыборкаПоТоварам.РезервПокупателя);		
		ОсталосьСписать = ОсталосьСписать - СписаноСРезерва;
		
		СвободныйОстаток = ВыборкаПоТоварам.Остаток - ВыборкаПоТоварам.СуммарныйРезерв;
		Если ОсталосьСписать > СвободныйОстаток Тогда
			Отказ = Истина;
			Сообщить(СтрШаблон("Не хватате товара %1! Доступный остаток на складе: %2.", ВыборкаПоТоварам.Товар, СвободныйОстаток + ВыборкаПоТоварам.РезервПокупателя));
			Продолжить;
		КонецЕсли;
		
		Если СписаноСРезерва > 0 Тогда
			Движение = Движения.ТоварыВРезерве.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
			Движение.Период = Дата;
			Движение.Товар = ВыборкаПоТоварам.Товар;
			Движение.Покупатель = Покупатель;
			Движение.Количество = СписаноСРезерва;	
		КонецЕсли;
		
		Движение = Движения.ОстатакиТовара.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = ВыборкаПоТоварам.Товар;
		Движение.Количество = ВыборкаПоТоварам.Требуется;
	КонецЦикла;
КонецПроцедуры
