
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяСостав.Номенклатура КАК Номенклатура,
		|	СУММА(РасходнаяНакладнаяСостав.Количество) КАК Количество,
		|	СУММА(РасходнаяНакладнаяСостав.Сумма) КАК Сумма
		|ПОМЕСТИТЬ ВТ_ВыбранныеТовары
		|ИЗ
		|	Документ.РасходнаяНакладная.Состав КАК РасходнаяНакладнаяСостав
		|ГДЕ
		|	РасходнаяНакладнаяСостав.Ссылка = &Ссылка
		|	И РасходнаяНакладнаяСостав.Номенклатура.ВидНоменклатуры = &ВидНоменклатурыТовар
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяНакладнаяСостав.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВыбранныеТовары.Номенклатура КАК Номенклатура,
		|	ВТ_ВыбранныеТовары.Количество КАК Количество,
		|	ВТ_ВыбранныеТовары.Сумма КАК Сумма
		|ИЗ
		|	ВТ_ВыбранныеТовары КАК ВТ_ВыбранныеТовары";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("ВидНоменклатурыТовар", Перечисления.ВидыНоменклатуры.Товар);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Движения.ОстаткиТоваров.Записывать = Истина;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ДвижениеОстатки = Движения.ОстаткиТоваров.Добавить();
		ДвижениеОстатки.ВидДвижения = ВидДвиженияНакопления.Расход;
		ДвижениеОстатки.Период = Дата;
		ДвижениеОстатки.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
		ДвижениеОстатки.Склад = Склад;
		ДвижениеОстатки.Количество = ВыборкаДетальныеЗаписи.Количество; 
	КонецЦикла; 
	Движения.ОстаткиТоваров.Записать();

	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ОстаткиТоваровОстатки.Номенклатура КАК Номенклатура,
		|	ОстаткиТоваровОстатки.Склад КАК Склад,
		|	ОстаткиТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиТоваров.Остатки(
		|			&МоментВремени,
		|			Номенклатура В
		|					(ВЫБРАТЬ
		|						ВТ.Номенклатура
		|					ИЗ
		|						ВТ_ВыбранныеТовары КАК ВТ)
		|				И Склад = &Склад) КАК ОстаткиТоваровОстатки
		|ГДЕ
		|	ОстаткиТоваровОстатки.КоличествоОстаток < 0";
	ГраницаКонтроля = Новый Граница(МоментВремени(), ВидГраницы.Включая);
	Запрос.УстановитьПараметр("МоментВремени", ГраницаКонтроля);
	Запрос.УстановитьПараметр("Склад", Склад);
	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;  
		Сообщение = Новый СообщениеПользователю;
		ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			Сообщение.Текст = СтрШаблон("Не хватает %1 шт. товара %2", -ВыборкаДетальныеЗаписи.КоличествоОстаток, ВыборкаДетальныеЗаписи.Номенклатура);
			Сообщение.Сообщить();
		КонецЦикла;
	КонецЕсли;

КонецПроцедуры      
