
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.СборыДляИменинников.Записывать = Истина;
	Движение = Движения.СборыДляИменинников.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Именинник = Именинник;
	Движение.Сумма = СоставДокумента.Итог("Сумма");
	
	Движения.ВзаиморасчетыСоСтудентами.Записывать = Истина;
	Для Каждого ТекСтрокаСоставДокумента Из СоставДокумента Цикл
		Движение = Движения.ВзаиморасчетыСоСтудентами.Добавить();
		Движение.Период = Дата;
		Движение.Студент = ТекСтрокаСоставДокумента.Студент;
		Движение.СуммаСдал = ТекСтрокаСоставДокумента.Сумма;
	КонецЦикла;
КонецПроцедуры
