
Процедура ОбработкаПроведения(Отказ, РежимПроведения)  
	Движения.ВзаиморасчетыСКлиентами.Очистить();
	Движения.ВзаиморасчетыСКлиентами.Записывать = Истина;
	Движения.ВзаиморасчетыСКлиентами.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриходДенегДоговоры.Договор КАК Договор,
	               |	МИНИМУМ(ПриходДенегДоговоры.НомерСтроки) КАК НомерСтроки
	               |ПОМЕСТИТЬ ВТ_ВыбранныеДоговоры
	               |ИЗ
	               |	Документ.ПриходДенег.Договоры КАК ПриходДенегДоговоры
	               |ГДЕ
	               |	ПриходДенегДоговоры.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПриходДенегДоговоры.Договор
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВзаиморасчетыСКлиентамиОстатки.Субконто2 КАК Договор,
	               |	ЕСТЬNULL(ВзаиморасчетыСКлиентамиОстатки.СуммаОстаток, 0) КАК Сумма
	               |ИЗ
	               |	ВТ_ВыбранныеДоговоры КАК ВТ_ВыбранныеДоговоры
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрБухгалтерии.ВзаиморасчетыСКлиентами.Остатки(
	               |				&МоментВремени,
	               |				Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.Покупатели),
	               |				,
	               |				Субконто1 = &Контрагент
	               |					И Субконто2 В
	               |						(ВЫБРАТЬ
	               |							ВТ.Договор
	               |						ИЗ
	               |							ВТ_ВыбранныеДоговоры КАК ВТ)) КАК ВзаиморасчетыСКлиентамиОстатки
	               |		ПО ВТ_ВыбранныеДоговоры.Договор = ВзаиморасчетыСКлиентамиОстатки.Субконто2
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВТ_ВыбранныеДоговоры.НомерСтроки"; 
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Контрагент", Плательщик);	
	РезультатЗапроса = Запрос.Выполнить(); 
	
	ЗадолженностиПоДоговорам = РезультатЗапроса.Выбрать();
	ОсталосьВыплатить = Сумма;
	Пока ЗадолженностиПоДоговорам.Следующий() Цикл 
		СуммаОплаты = Мин(ОсталосьВыплатить, ЗадолженностиПоДоговорам.Сумма);
		ОсталосьВыплатить = ОсталосьВыплатить - СуммаОплаты;
		Проводка = Движения.ВзаиморасчетыСКлиентами.Добавить();
		Проводка.Период = Дата;
		Проводка.СчетДт = ПланыСчетов.Основной.Касса;
		Проводка.СчетКт = ПланыСчетов.Основной.Покупатели;
		Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоВзаиморасчетыСКлиентами.Контрагенты] = Плательщик;
		Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоВзаиморасчетыСКлиентами.Договоры] = ЗадолженностиПоДоговорам.Договор;
		Проводка.Сумма = СуммаОплаты;  
		
		Если ОсталосьВыплатить = 0 Тогда
			Возврат;
		КонецЕсли;
	КонецЦикла;   
	
	ДоговорАванса = Справочники.Договоры.ПолучитьДоговорАванса(Плательщик);
	Проводка = Движения.ВзаиморасчетыСКлиентами.Добавить();
	Проводка.Период = Дата;
	Проводка.СчетДт = ПланыСчетов.Основной.Касса;
	Проводка.СчетКт = ПланыСчетов.Основной.Покупатели;
	Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоВзаиморасчетыСКлиентами.Контрагенты] = Плательщик;
	Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоВзаиморасчетыСКлиентами.Договоры] = ДоговорАванса;
	Проводка.Сумма = ОсталосьВыплатить;  
КонецПроцедуры
