
Процедура ОбработкаПроведения(Отказ, Режим)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ВозвратИзРемонтаСписокОборудования.Оборудование КАК Оборудование,
	                      |	СУММА(ВозвратИзРемонтаСписокОборудования.Количество) КАК Требуется
	                      |ПОМЕСТИТЬ ВТ_ВыбранноеОборудование
	                      |ИЗ
	                      |	Документ.ВозвратИзРемонта.СписокОборудования КАК ВозвратИзРемонтаСписокОборудования
	                      |ГДЕ
	                      |	ВозвратИзРемонтаСписокОборудования.Ссылка = &Ссылка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ВозвратИзРемонтаСписокОборудования.Оборудование
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ЕСТЬNULL(ОстаткиОборудованияОстатки.КоличествоОстаток, 0) КАК Остаток,
	                      |	ОстаткиОборудованияОстатки.Оборудование КАК Оборудование,
	                      |	ВТ_ВыбранноеОборудование.Требуется КАК Требуется
	                      |ИЗ
	                      |	ВТ_ВыбранноеОборудование КАК ВТ_ВыбранноеОборудование
	                      |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиОборудования.Остатки(
	                      |				&МоментВремени,
	                      |				Оборудование В
	                      |						(ВЫБРАТЬ
	                      |							ВТ.Оборудование
	                      |						ИЗ
	                      |							ВТ_ВыбранноеОборудование КАК ВТ)
	                      |					И Статус = &Статус
	                      |					И РабочееМесто = &РабочееМесто) КАК ОстаткиОборудованияОстатки
	                      |		ПО ВТ_ВыбранноеОборудование.Оборудование = ОстаткиОборудованияОстатки.Оборудование");
	
	Запрос.УстановитьПараметр("Ссылка", ЭтотОбъект.Ссылка);
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Статус", Перечисления.СтатусыОборудования.ВРемонте);
	Запрос.УстановитьПараметр("РабочееМесто", РабочееМесто);

	ВыбранноеОборудование = Запрос.Выполнить().Выбрать();
	
	Движения.ОстаткиОборудования.Записывать = Истина;
	Пока ВыбранноеОборудование.Следующий() Цикл
		Если ВыбранноеОборудование.Остаток < ВыбранноеОборудование.Требуется Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Не хватает оборудования " + ВыбранноеОборудование.Оборудование + 
				" для проведения операции. Находится в ремонте: " + ВыбранноеОборудование.Остаток; 
			Сообщение.Сообщить();			
			Отказ = Истина;
			Прервать;
		КонецЕсли;
		
		Движение = Движения.ОстаткиОборудования.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Оборудование = ВыбранноеОборудование.Оборудование;
		Движение.Статус = Перечисления.СтатусыОборудования.ВРемонте; 
		Движение.РабочееМесто = РабочееМесто;
		Движение.Количество = ВыбранноеОборудование.Требуется;
		
		Движение = Движения.ОстаткиОборудования.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
		Движение.Период = Дата;
		Движение.Оборудование = ВыбранноеОборудование.Оборудование;
		Движение.Статус = Перечисления.СтатусыОборудования.ВРаботе;
		Движение.РабочееМесто = РабочееМесто;
		Движение.Количество = ВыбранноеОборудование.Требуется;
	КонецЦикла;
КонецПроцедуры
