
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	Движения.ПартииТоваров.Очистить();
	Движения.ПартииТоваров.Записывать = Истина;
	Движения.ПартииТоваров.Записать();  
	
	Движения.Продажи.Очистить();
	Движения.Продажи.Записывать = Истина;
	Движения.Продажи.Записать(); 
	
	ПолитикаПродажиОтсутствующихТоваров = РегистрыСведений.ПолитикаКомпании.ПолучитьПоследнее(Дата).ЗначениеПолитикаПродажиОтсутствующихТоваров;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РасходнаяНакладнаяСостав.Номенклатура КАК Номенклатура,
		|	СУММА(РасходнаяНакладнаяСостав.Количество) КАК Количество,
		|	СУММА(РасходнаяНакладнаяСостав.Сумма) КАК Сумма
		|ПОМЕСТИТЬ ВТ_ВыбранныеТовары
		|ИЗ
		|	Документ.РасходнаяНакладная.Состав КАК РасходнаяНакладнаяСостав
		|ГДЕ
		|	РасходнаяНакладнаяСостав.Ссылка = &Ссылка
		|
		|СГРУППИРОВАТЬ ПО
		|	РасходнаяНакладнаяСостав.Номенклатура
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ
		|	ВТ_ВыбранныеТовары.Номенклатура КАК Номенклатура,
		|	ВТ_ВыбранныеТовары.Количество КАК Количество,
		|	ВТ_ВыбранныеТовары.Сумма КАК Сумма,
		|	ПартииТоваровОстатки.Партия КАК Партия,
		|	ПартииТоваровОстатки.СрокГодности КАК СрокГодности,
		|	ЕСТЬNULL(ПартииТоваровОстатки.КоличествоОстаток, 0) КАК КоличествоОстаток,
		|	ЕСТЬNULL(ПартииТоваровОстатки.СтоимостьОстаток, 0) КАК СтоимостьОстаток
		|ИЗ
		|	ВТ_ВыбранныеТовары КАК ВТ_ВыбранныеТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваров.Остатки(
		|				&МоментВремени,
		|				Номенклатура В
		|					(ВЫБРАТЬ
		|						ВТ.Номенклатура
		|					ИЗ
		|						ВТ_ВыбранныеТовары КАК ВТ)) КАК ПартииТоваровОстатки
		|		ПО ВТ_ВыбранныеТовары.Номенклатура = ПартииТоваровОстатки.Номенклатура
		|
		|УПОРЯДОЧИТЬ ПО
		|	Номенклатура,
		|	СрокГодности,
		|	СтоимостьОстаток УБЫВ
		|ИТОГИ
		|	МАКСИМУМ(Количество),
		|	СУММА(КоличествоОстаток)
		|ПО
		|	Номенклатура";
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаНоменклатура = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Пока ВыборкаНоменклатура.Следующий() Цикл 
		РазностьКолОст = ВыборкаНоменклатура.Количество - ВыборкаНоменклатура.КоличествоОстаток;
		Если РазностьКолОст > 0 И ПолитикаПродажиОтсутствующихТоваров = Перечисления.ПолитикаПродажиОтсутствующихТоваров.Запретить Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("На складе не хватает %1 шт. товара %2", ВыборкаНоменклатура.Номенклатура, РазностьКолОст);    
			Сообщение.Сообщить(); 
			Отказ = Истина;
			Продолжить;
		КонецЕсли;
 
		ТребуетсяПродать = ВыборкаНоменклатура.Количество;
		СуммарнаяСебестоимостьПроданного = 0;
		
		ВыборкаДетальныеЗаписи = ВыборкаНоменклатура.Выбрать();
		
		Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
			ПартияПроданноКоличество = Мин(ТребуетсяПродать, ВыборкаДетальныеЗаписи.КоличествоОстаток);
			Если ПартияПроданноКоличество = 0 Тогда
				Прервать;
			КонецЕсли;
			ТребуетсяПродать = ТребуетсяПродать - ПартияПроданноКоличество; 
			
			ПартияНоваяСебестоимость = ВыборкаДетальныеЗаписи.СтоимостьОстаток;
			Если Не ПартияПроданноКоличество = ВыборкаДетальныеЗаписи.КоличествоОстаток Тогда
				ПартияНоваяСебестоимость = ВыборкаДетальныеЗаписи.СтоимостьОстаток / ВыборкаДетальныеЗаписи.КоличествоОстаток * ПартияПроданноКоличество;
			КонецЕсли;    
			СуммарнаяСебестоимостьПроданного = СуммарнаяСебестоимостьПроданного + ПартияНоваяСебестоимость;
			
			ДвижениеПартии = Движения.ПартииТоваров.Добавить();
			ДвижениеПартии.ВидДвижения = ВидДвиженияНакопления.Расход;  
			ДвижениеПартии.Период = Дата;
			ДвижениеПартии.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			ДвижениеПартии.Партия = ВыборкаДетальныеЗаписи.Партия;
			ДвижениеПартии.СрокГодности = ВыборкаДетальныеЗаписи.СрокГодности;
			ДвижениеПартии.Количество = ПартияПроданноКоличество;
			ДвижениеПартии.Стоимость = ПартияНоваяСебестоимость;  
		КонецЦикла; 
		
		Если ТребуетсяПродать > 0 Тогда
			ДвижениеПартии = Движения.ПартииТоваров.Добавить();
			ДвижениеПартии.ВидДвижения = ВидДвиженияНакопления.Расход;  
			ДвижениеПартии.Период = Дата;
			ДвижениеПартии.Номенклатура = ВыборкаДетальныеЗаписи.Номенклатура;
			ДвижениеПартии.Количество = ТребуетсяПродать;
			ДвижениеПартии.Стоимость = 0; 	
		КонецЕсли;
		
		ДвижениеПродажи = Движения.Продажи.Добавить();  
		ДвижениеПродажи.Период = Дата;
		ДвижениеПродажи.Номенклатура = ВыборкаНоменклатура.Номенклатура;
		ДвижениеПродажи.СрокГодности = ВыборкаНоменклатура.СрокГодности;
		ДвижениеПродажи.Количество = ВыборкаНоменклатура.Количество;   
		ДвижениеПродажи.Себестоимость = СуммарнаяСебестоимостьПроданного;
		ДвижениеПродажи.СуммаПродаж = ВыборкаНоменклатура.Сумма; 
	КонецЦикла;
	
	//}}КОНСТРУКТОР_ЗАПРОСА_С_ОБРАБОТКОЙ_РЕЗУЛЬТАТА

КонецПроцедуры      

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	Если РежимЗаписи = РежимЗаписиДокумента.Проведение Тогда
		Если ЭтоНовый() И Дата < ТекущаяДатаСеанса() Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Документ не может быть проведен задним числом!";
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;    
	КонецЕсли;
КонецПроцедуры
