
Процедура ОбработкаПроведения(Отказ, Режим)  
	Движения.ОстаткиТоваров.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	РеализацияТовараТовары.Товар.Наименование КАК ТоварНаименование,
		|	РеализацияТовараТовары.Количество КАК Количество,
		|	ЕСТЬNULL(ОстаткиТоваровОстатки.КоличествоОстаток, 0) КАК Остаток
		|ИЗ
		|	Документ.РеализацияТовара.Товары КАК РеализацияТовараТовары
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки КАК ОстаткиТоваровОстатки
		|		ПО РеализацияТовараТовары.Товар = ОстаткиТоваровОстатки.Товар
		|ГДЕ
		|	РеализацияТовараТовары.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();    
	
	Движения.ОстаткиТоваров.Записывать = Истина; 
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл 
		Остаток = ВыборкаДетальныеЗаписи.Остаток; 
		Количество = ВыборкаДетальныеЗаписи.Количество;   
		Наименование = ВыборкаДетальныеЗаписи.ТоварНаименование;
		
		Если Количество > Остаток Тогда 			
			Сообщить("Не хватате товара " + Наименование + " на складе. Остаток: " + Остаток); 
			Отказ = Истина;
		КонецЕсли; 
	КонецЦикла; 
	
	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;                 	
		Движение.Период = Дата;
		Движение.Товар = ТекСтрокаТовары.Товар;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла; 
КонецПроцедуры
