
Процедура ОбработкаПроведения(Отказ, Режим)
	//{{__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
	// Данный фрагмент построен конструктором.
	// При повторном использовании конструктора, внесенные вручную изменения будут утеряны!!!

	// регистр Остатки Приход
	Движения.ОстаткиТоваров.Записывать = Истина;
	Движения.ПартииТоваров.Записывать = Истина;
	Для Каждого ТекСтрокаСостав Из Состав Цикл
		ДвижениеОстатки = Движения.ОстаткиТоваров.Добавить();
		ДвижениеОстатки.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеОстатки.Период = Дата;
		ДвижениеОстатки.Номенклатура = ТекСтрокаСостав.Номенклатура;
		ДвижениеОстатки.Склад = Склад;
		ДвижениеОстатки.Количество = ТекСтрокаСостав.Количество;
		
		ДвижениеПартии = Движения.ПартииТоваров.Добавить(); 
		ДвижениеПартии.ВидДвижения = ВидДвиженияНакопления.Приход;
		ДвижениеПартии.Период = Дата;
		ДвижениеПартии.Номенклатура = ТекСтрокаСостав.Номенклатура;
		ДвижениеПартии.Партия = Ссылка;
		ДвижениеПартии.Количество = ТекСтрокаСостав.Количество;
		ДвижениеПартии.Себестоимость = ТекСтрокаСостав.Себестоимость;
	КонецЦикла;

	//}}__КОНСТРУКТОР_ДВИЖЕНИЙ_РЕГИСТРОВ
КонецПроцедуры
