
&НаСервере
Процедура ВидОборудованияПриИзмененииНаСервере()
	СписокСвойств.Загрузить(Объект.ВидОборудования.СписокСвойств.Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ВидОборудованияПриИзменении(Элемент)
	ВидОборудованияПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ЗначенияСвойствОборудования.Свойство КАК Свойство,
		|	ЗначенияСвойствОборудования.Значение КАК Значение
		|ИЗ
		|	РегистрСведений.ЗначенияСвойствОборудования КАК ЗначенияСвойствОборудования
		|ГДЕ
		|	ЗначенияСвойствОборудования.Оборудование = &Оборудование";
	
	Запрос.УстановитьПараметр("Оборудование", Объект.Ссылка);
	
	СписокСвойств.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	ЗаписиДляРегистра = СписокСвойств.Выгрузить();
	ЗаписиДляРегистра.Колонки.Добавить("Оборудование");	
	ЗаписиДляРегистра.ЗаполнитьЗначения(Объект.Ссылка, "Оборудование");
	
	НаборЗаписей = РегистрыСведений.ЗначенияСвойствОборудования.СоздатьНаборЗаписей();
	НаборЗаписей.Загрузить(ЗаписиДляРегистра);
	НаборЗаписей.Записать(РежимЗамещения.Обновление);
КонецПроцедуры

&НаСервере
Процедура ОбработкаПроверкиЗаполненияНаСервере(Отказ, ПроверяемыеРеквизиты)
	Для Каждого Строка Из СписокСвойств Цикл
		Если Не ЗначениеЗаполнено(Строка.Значение) И ТипЗнч(Строка.Значение) <> "Булево" Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = "Заполните значение свойства: " + Строка.Свойство;
			Сообщение.Поле = "СписокСвойств[" + Формат(СписокСвойств.Индекс(Строка), "ЧГ=0") + "].Значение";
			Сообщение.Сообщить();
			
			Отказ = Истина;	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
