
Процедура ОбработкаПроведения(Отказ, РежимПроведения)  
	Движения.ВзаиморасчетыСКлиентами.Очистить();
	Движения.ВзаиморасчетыСКлиентами.Записывать = Истина;
	Движения.ВзаиморасчетыСКлиентами.Записать();
	
	Проводка = Движения.ВзаиморасчетыСКлиентами.Добавить();
	Проводка.Период = Дата;
	Проводка.СчетДт = ПланыСчетов.Основной.Покупатели;    
	Проводка.СчетКт = ПланыСчетов.Основной.ПрибылиИУбытки;
	Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоВзаиморасчетыСКлиентами.Договоры] = Договор;
	Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоВзаиморасчетыСКлиентами.Контрагенты] = Покупатель;    
	Проводка.Сумма = Сумма; 
	Движения.ВзаиморасчетыСКлиентами.Записать();
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВзаиморасчетыСКлиентамиОстатки.Субконто1 КАК Контрагент,
	               |	ВзаиморасчетыСКлиентамиОстатки.СуммаОстаток КАК Оплачено
	               |ИЗ
	               |	РегистрБухгалтерии.ВзаиморасчетыСКлиентами.Остатки(&МоментВремени, Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.Касса), , Субконто1 = &Контрагент) КАК ВзаиморасчетыСКлиентамиОстатки
	               |ГДЕ
	               |	ВзаиморасчетыСКлиентамиОстатки.СуммаОстаток < 0";
	ГраницаКонтроля = Новый Граница(МоментВремени(), ВидГраницы.Включая);
	Запрос.УстановитьПараметр("МоментВремени", ГраницаКонтроля);  
	Запрос.УстановитьПараметр("Контрагент", Покупатель);
	РезультатЗапроса = Запрос.Выполнить();
	
	Если Не РезультатЗапроса.Пустой() Тогда  
		Отказ = Истина;
		ВыборкаПереплат = РезультатЗапроса.Выбрать();
		Пока ВыборкаПереплат.Следующий() Цикл
			 Сообщение = Новый СообщениеПользователю;
			 Сообщение.Текст = СтрШаблон("Переплата по договору %1 с покупателем %2 на сумма %3", Договор, Покупатель, -ВыборкаПереплат.Оплачено);
			 Сообщение.Сообщить();  
		КонецЦикла;
	КонецЕсли;  
КонецПроцедуры
