
Процедура ОбработкаПроведения(Отказ, Режим)
	ДатаПроведения = Дата;
	МассивТоваров = Товары.ВыгрузитьКолонку("Товар"); 
	ТабличнаяЧасть = Товары.Выгрузить();
	ТабличнаяЧасть.Свернуть("Товар", "Количество");
	
	Запрос = Новый Запрос; 
	Запрос.Текст = "ВЫБРАТЬ
	               |	ТабличнаяЧасть.Товар КАК Товар,
	               |	ТабличнаяЧасть.Количество КАК Количество
	               |ПОМЕСТИТЬ ВТ_ТЧДокумента
	               |ИЗ
	               |	&ТабличнаяЧасть КАК ТабличнаяЧасть
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ_ТЧДокумента.Товар КАК Товар,
	               |	ОстаткиТовара.СрокГодности КАК СрокГодности,
	               |	ЕСТЬNULL(ОстаткиТовара.ОстаткиОстаток, 0) КАК Остатки,
	               |	ВТ_ТЧДокумента.Количество КАК ОсталосьСписать
	               |ИЗ
	               |	ВТ_ТЧДокумента КАК ВТ_ТЧДокумента
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТовара.Остатки(&ДатаПроведения, Товар В (&МассивТоваров)) КАК ОстаткиТовара
	               |		ПО (ОстаткиТовара.Товар = ВТ_ТЧДокумента.Товар)
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	СрокГодности
	               |ИТОГИ
	               |	СУММА(Остатки),
	               |	МАКСИМУМ(ОсталосьСписать)
	               |ПО
	               |	Товар,
	               |	СрокГодности"; 
	
	Запрос.УстановитьПараметр("ДатаПроведения", ДатаПроведения);
	Запрос.УстановитьПараметр("МассивТоваров", МассивТоваров); 
	Запрос.УстановитьПараметр("ТабличнаяЧасть", ТабличнаяЧасть);
	
	ВыборкаПоТоварам = Запрос.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	
	Движения.ОстаткиТовара.Записывать = Истина;
	Движения.ПродажиТовара.Записывать = Истина;

	Пока ВыборкаПоТоварам.Следующий() Цикл 
		ОсталосьСписать = ВыборкаПоТоварам.ОсталосьСписать;
		ОбщийОстаток = ВыборкаПоТоварам.Остатки;
		
		Если ОбщийОстаток < ОсталосьСписать Тогда
			Отказ = Истина;
			Сообщить("На складе недостаточно товара: " + ВыборкаПоТоварам.Товар + ". Остаток: " + ВыборкаПоТоварам.Остатки);
			Продолжить;
		КонецЕсли;      
		
		Движение = Движения.ПродажиТовара.Добавить(); 
		Движение.Период = Дата;
		Движение.Товар = ВыборкаПоПартиям.Товар;
		Движение.Количество = ВыборкаПоПартиям.ОсталосьСписать;
		Движение.Сумма = ВыборкаПоПартиям.;   
		
		ВыборкаПоПартиям = ВыборкаПоТоварам.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);		
		Пока ВыборкаПоПартиям.Следующий() Цикл 
        	СписатьСПартии = Мин(ОсталосьСписать, ВыборкаПоПартиям.Остатки);
			
			Движение = Движения.ОстаткиТовара.Добавить();
			Движение.ВидДвижения = ВидДвиженияНакопления.Расход; 
			Движение.Период = Дата;
			Движение.Товар = ВыборкаПоПартиям.Товар;
			Движение.СрокГодности = ВыборкаПоПартиям.СрокГодности;
			Движение.Остатки = СписатьСПартии;   

			ОсталосьСписать = ОсталосьСписать - СписатьСПартии; 
			
			Если ОсталосьСписать = 0 Тогда
				Прервать;
			КонецЕсли;
		КонецЦикла;
	КонецЦикла;  
КонецПроцедуры
