
Процедура ОбработкаПроведения(Отказ, РежимПроведения)  
	Движения.ВзаиморасчетыСКлиентами.Записывать = Истина; 
	Движения.ВзаиморасчетыСКлиентами.Записать();
	
	Запрос = Новый Запрос();
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВзаиморасчетыСКлиентамиОстатки.Субконто1 КАК Контрагент,
	               |	ВзаиморасчетыСКлиентамиОстатки.Субконто2 КАК Договор,
	               |	ВзаиморасчетыСКлиентамиОстатки.Субконто3 КАК Документ,
	               |	ВзаиморасчетыСКлиентамиОстатки.СуммаОстаток КАК Сумма
	               |ИЗ
	               |	РегистрБухгалтерии.ВзаиморасчетыСКлиентами.Остатки(&МоментВремени, Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.Покупатели), , Субконто1 = &Субконто) КАК ВзаиморасчетыСКлиентамиОстатки
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	ВЫРАЗИТЬ(ВзаиморасчетыСКлиентамиОстатки.Субконто2 КАК Справочник.Договоры).ДатаОкончания,
	               |	ВзаиморасчетыСКлиентамиОстатки.Субконто3
	               |ИТОГИ
	               |	СУММА(Сумма)
	               |ПО
	               |	Контрагент";       
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени()); 
	Запрос.УстановитьПараметр("Ссылка", Ссылка); 
	Запрос.УстановитьПараметр("Субконто", Контрагент);
	РезультатЗапроса = Запрос.Выполнить(); 
	
	ИтогПоКонтрагенту = РезультатЗапроса.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам); 
	ИтогПоКонтрагенту.Следующий(); 
	Переплата = Сумма - ИтогПоКонтрагенту.Сумма;
	Если Переплата > 0 Тогда
		Отказ = Истина; 
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = СтрШаблон("Переплата в размере %1 руб.", Переплата);  
		Сообщение.Сообщить();
		Возврат;
	КонецЕсли;     
	
	ЗадолженностиПоРасходнымНакладным = ИтогПоКонтрагенту.Выбрать();
	ОсталосьСписать = Сумма;
	Пока ЗадолженностиПоРасходнымНакладным.Следующий() Цикл    
		СписаноПоНакладной = Мин(ОсталосьСписать, ЗадолженностиПоРасходнымНакладным.Сумма);  
		ОсталосьСписать = ОсталосьСписать - СписаноПоНакладной;
		
		Проводка = Движения.ВзаиморасчетыСКлиентами.Добавить();
		Проводка.Период = Дата;  
		Проводка.СчетДт = ПланыСчетов.Основной.Касса;
		Проводка.СчетКт = ПланыСчетов.Основной.Покупатели;
		Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоВзаиморасчетыСКлиентами.Договоры] = ЗадолженностиПоРасходнымНакладным.Договор;
		Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоВзаиморасчетыСКлиентами.Контрагенты] = ЗадолженностиПоРасходнымНакладным.Контрагент;   
		Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоВзаиморасчетыСКлиентами.Документы] = ЗадолженностиПоРасходнымНакладным.Документ; 
		Проводка.Сумма = СписаноПоНакладной;  
		
		Если ОсталосьСписать = 0 Тогда
			Прервать;	
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры
