
Процедура ОбработкаПроведения(Отказ, РежимПроведения)  
	Запрос = Новый Запрос();
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриходДенегСостав.Контрагент КАК Контрагент,
	               |	ПриходДенегСостав.Договор КАК Договор,
	               |	СУММА(ПриходДенегСостав.Сумма) КАК Сумма
	               |ИЗ
	               |	Документ.ПриходДенег.Состав КАК ПриходДенегСостав
	               |ГДЕ
	               |	ПриходДенегСостав.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПриходДенегСостав.Контрагент,
	               |	ПриходДенегСостав.Договор";        
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();     
	
	Движения.ВзаиморасчетыСКлиентами.Очистить();   
	ПлатежиПоДоговорам = РезультатЗапроса.Выбрать();
	Пока ПлатежиПоДоговорам.Следующий() Цикл
		Движения.ВзаиморасчетыСКлиентами.Записывать = Истина;
		Проводка = Движения.ВзаиморасчетыСКлиентами.Добавить(); 
		Проводка.Период = Дата; 
		Проводка.СчетДт = ПланыСчетов.Основной.Касса;
		Проводка.СчетКт = ПланыСчетов.Основной.Покупатели;  
		Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоВзаиморасчетыСКлиентами.Договоры] = ПлатежиПоДоговорам.Договор;
	    Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоВзаиморасчетыСКлиентами.Контрагенты] = ПлатежиПоДоговорам.Контрагент;
		Проводка.Сумма = ПлатежиПоДоговорам.Сумма;      
	КонецЦикла;                               
	
	Движения.ВзаиморасчетыСКлиентами.Записывать = Истина;
	Движения.Записать();
	
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВзаиморасчетыСКлиентамиОстатки.Субконто1 КАК Договор,
	               |	ВзаиморасчетыСКлиентамиОстатки.Субконто2 КАК Контрагент,
	               |	ВзаиморасчетыСКлиентамиОстатки.СуммаОстаток КАК Сумма
	               |ИЗ
	               |	РегистрБухгалтерии.ВзаиморасчетыСКлиентами.Остатки(&ГраницаКонтроля, Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.Покупатели), , ) КАК ВзаиморасчетыСКлиентамиОстатки
	               |ГДЕ
	               |	ВзаиморасчетыСКлиентамиОстатки.СуммаОстаток < 0";   
	ГраницаКонтроля = Новый Граница(МоментВремени(), ВидГраницы.Включая);
	Запрос.УстановитьПараметр("ГраницаКонтроля", ГраницаКонтроля);
	РезультатЗапроса = Запрос.Выполнить();     
	
	Если Не РезультатЗапроса.Пустой() Тогда
		Отказ = Истина;
		ВыборкаПереплат = РезультатЗапроса.Выбрать();
		Пока ВыборкаПереплат.Следующий() Цикл
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Переплата в размере %1 руб. по договору %2 с покупателем %3", -ВыборкаПереплат.Сумма, ВыборкаПереплат.Договор, ВыборкаПереплат.Контрагент);      
			Сообщение.Сообщить();
		КонецЦикла;
	КонецЕсли;
КонецПроцедуры
