Процедура РасчитатьСебестоимость() Экспорт   
	ГраницаПоследовательности = Последовательности.ПартионныйУчет.ПолучитьГраницу();  
	УчетнаяПолитика = РегистрыСведений.УчетнаяПолитика.ПолучитьПоследнее(ТекущаяДатаСеанса()); // использовать

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	ПартионныйУчет.Регистратор КАК Документ,
		|	ПартионныйУчет.Период КАК Период
		|ИЗ
		|	Последовательность.ПартионныйУчет КАК ПартионныйУчет
		|ГДЕ
		|	ПартионныйУчет.МоментВремени > &ГраницаПоследовательности
		|	И ПартионныйУчет.Регистратор ССЫЛКА Документ.РасходнаяНакладная
		|
		|УПОРЯДОЧИТЬ ПО
		|	Период,
		|	Регистратор";
	
	Запрос.УстановитьПараметр("ГраницаПоследовательности", ГраницаПоследовательности);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДокументы = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДокументы.Следующий() Цикл   
		
		ТекущийДокумент = ВыборкаДокументы.Документ;

		Запрос = Новый Запрос;
		Запрос.Текст = 
			"ВЫБРАТЬ
			|	РасходнаяНакладнаяСостав.Номенклатура КАК Номенклатура,
			|	РасходнаяНакладнаяСостав.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
			|	СУММА(РасходнаяНакладнаяСостав.Количество) КАК Количество
			|ПОМЕСТИТЬ ВТ_НоменклатураДокумента
			|ИЗ
			|	Документ.РасходнаяНакладная.Состав КАК РасходнаяНакладнаяСостав
			|ГДЕ
			|	РасходнаяНакладнаяСостав.Ссылка = &Документ
			|
			|СГРУППИРОВАТЬ ПО
			|	РасходнаяНакладнаяСостав.Номенклатура,
			|	РасходнаяНакладнаяСостав.Номенклатура.ВидНоменклатуры
			|;
			|
			|////////////////////////////////////////////////////////////////////////////////
			|ВЫБРАТЬ
			|	ВТ_НоменклатураДокумента.Номенклатура КАК Номенклатура,
			|	ВТ_НоменклатураДокумента.ВидНоменклатуры КАК ВидНоменклатуры,
			|	ВТ_НоменклатураДокумента.Количество КАК Количество,
			|	ПартииТоваровОстатки.Партия КАК Партия,
			|	ПартииТоваровОстатки.КоличествоОстаток КАК КоличествоОстаток,
			|	ПартииТоваровОстатки.СебестоимостьОстаток КАК СебестоимостьОстаток
			|ИЗ
			|	ВТ_НоменклатураДокумента КАК ВТ_НоменклатураДокумента
			|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ПартииТоваров.Остатки(
			|				&МоментВремени,
			|				Номенклатура В
			|					(ВЫБРАТЬ
			|						ВТ.Номенклатура
			|					ИЗ
			|						ВТ_НоменклатураДокумента КАК ВТ)) КАК ПартииТоваровОстатки
			|		ПО ВТ_НоменклатураДокумента.Номенклатура = ПартииТоваровОстатки.Номенклатура
			|
			|УПОРЯДОЧИТЬ ПО
			|	ПартииТоваровОстатки.Партия.МоментВремени";
		
		Запрос.УстановитьПараметр("Документ", ТекущийДокумент);
		Запрос.УстановитьПараметр("МоментВремени", ТекущийДокумент.МоментВремени());
		
		// меняем запрос по уч. политике
		
		РезультатЗапроса = Запрос.Выполнить();
		
		ВыборкаТовары = РезультатЗапроса.Выбрать();
		
		Пока ВыборкаТовары.Следующий() Цикл

		КонецЦикла;    
		
	КонецЦикла;                           	
КонецПроцедуры