
Процедура ОбработкаПроведения(Отказ, РежимПроведения)  
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ПриходДенегСостав.Контрагент КАК Контрагент,
	               |	СУММА(ПриходДенегСостав.Сумма) КАК Сумма
	               |ИЗ
	               |	Документ.ПриходДенег.Состав КАК ПриходДенегСостав
	               |ГДЕ
	               |	ПриходДенегСостав.Ссылка = &Ссылка
	               |
	               |СГРУППИРОВАТЬ ПО
	               |	ПриходДенегСостав.Контрагент"; 
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	РезультатЗапроса = Запрос.Выполнить();
	
	Движения.ВзаиморасчетыСКлиентами.Записывать = Истина;
	Движения.ВзаиморасчетыСКлиентами.Записать();
	СписокПлатежей = РезультатЗапроса.Выбрать();     
	Пока СписокПлатежей.Следующий() Цикл
		Проводка = Движения.ВзаиморасчетыСКлиентами.Добавить();
		Проводка.Период = Дата;
		Проводка.СчетДт = ПланыСчетов.Основной.Касса;    
		Проводка.СчетКт = ПланыСчетов.Основной.Покупатели;
		Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоВзаиморасчетыСКлиентами.Контрагенты] = СписокПлатежей.Контрагент;   
		Проводка.Сумма = СписокПлатежей.Сумма;
	КонецЦикла;
КонецПроцедуры
