
&НаСервере
Процедура ПриОткрытииНаСервере()
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ЕСТЬNULL(ЗначенияСвойствЛекарств.Значение, """") КАК Значение,
	                      |	СвойстваЛекарств.Ссылка КАК Свойство
	                      |ИЗ
	                      |	ПланВидовХарактеристик.СвойстваЛекарств КАК СвойстваЛекарств
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ЗначенияСвойствЛекарств КАК ЗначенияСвойствЛекарств
	                      |		ПО (ЗначенияСвойствЛекарств.Свойство = СвойстваЛекарств.Ссылка)
	                      |			И (ЗначенияСвойствЛекарств.Лекарство = &Лекарство)");
	
	Запрос.УстановитьПараметр("Лекарство", Объект.Ссылка);
	
	СписокСвойств.Загрузить(Запрос.Выполнить().Выгрузить());
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПослеЗаписиНаСервере(ТекущийОбъект, ПараметрыЗаписи)
	СвойстваДляЗаписи = СписокСвойств.Выгрузить();
	СвойстваДляЗаписи.Колонки.Добавить("Лекарство");
	СвойстваДляЗаписи.ЗаполнитьЗначения(Объект.Ссылка, "Лекарство");
	
	НаборЗаписей = РегистрыСведений.ЗначенияСвойствЛекарств.СоздатьНаборЗаписей();	
	НаборЗаписей.Загрузить(СвойстваДляЗаписи);
	НаборЗаписей.Записать(РежимЗамещения.Слияние);
КонецПроцедуры
