
Процедура ОбработкаПроведения(Отказ, РежимПроведения)  
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура КАК Номенклатура,
	                      |	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
	                      |	РасходнаяНакладнаяСписокНоменклатуры.Партия КАК Партия,
	                      |	СУММА(РасходнаяНакладнаяСписокНоменклатуры.Количество) КАК Количество,
	                      |	СУММА(РасходнаяНакладнаяСписокНоменклатуры.Цена * РасходнаяНакладнаяСписокНоменклатуры.Количество) КАК Сумма
	                      |ПОМЕСТИТЬ ВТ_ВыбраннаяНоменкулатура
	                      |ИЗ
	                      |	Документ.РасходнаяНакладная.Состав КАК РасходнаяНакладнаяСписокНоменклатуры
	                      |ГДЕ
	                      |	РасходнаяНакладнаяСписокНоменклатуры.Ссылка = &Ссылка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура,
	                      |	РасходнаяНакладнаяСписокНоменклатуры.Партия,
	                      |	РасходнаяНакладнаяСписокНоменклатуры.Номенклатура.ВидНоменклатуры
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_ВыбраннаяНоменкулатура.Номенклатура КАК Номенклатура,
	                      |	ВТ_ВыбраннаяНоменкулатура.ВидНоменклатуры КАК ВидНоменклатуры,
	                      |	ВТ_ВыбраннаяНоменкулатура.Партия КАК Партия,
	                      |	ВТ_ВыбраннаяНоменкулатура.Количество КАК Требуется,
	                      |	ВТ_ВыбраннаяНоменкулатура.Сумма КАК Сумма
	                      |ИЗ
	                      |	ВТ_ВыбраннаяНоменкулатура КАК ВТ_ВыбраннаяНоменкулатура
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ОстаткиТоваровОстатки.Товар КАК Товар,
	                      |	ОстаткиТоваровОстатки.Партия КАК Партия,
	                      |	ОстаткиТоваровОстатки.КоличествоОстаток КАК Остаток,
	                      |	ОстаткиТоваровОстатки.СебестоимостьОстаток КАК Себестоимость
	                      |ИЗ
	                      |	РегистрНакопления.ОстаткиТоваров.Остатки(
	                      |			&МоментВремени,
	                      |			Товар В
	                      |				(ВЫБРАТЬ
	                      |					ВТ.Номенклатура
	                      |				ИЗ
	                      |					ВТ_ВыбраннаяНоменкулатура КАК ВТ)) КАК ОстаткиТоваровОстатки
	                      |
	                      |УПОРЯДОЧИТЬ ПО
	                      |	Партия &УчетнаяПолитика");    
	
	// todo: кажется вот так нельзя - ВТ_ВыбраннаяНоменкулатура.Номенклатура.ВидНоменклатуры
	
	ТекущийМоментВремени = МоментВремени();
	
	Запрос.УстановитьПараметр("МоментВремени", ТекущийМоментВремени); 
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	АктуальнаяЗаписьРегистраУчетнаяПолитика = РегистрыСведений.УчетнаяПолитика.СрезПоследних(ТекущийМоментВремени).Получить(0);
	Если Не ЗначениеЗаполнено(АктуальнаяЗаписьРегистраУчетнаяПолитика) Тогда
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = "Нет записей в регистре Учетная Политика!"; 
		Сообщение.Сообщить();  
		Отказ = Истина;
	КонецЕсли;
    УчетнаяПолитика = АктуальнаяЗаписьРегистраУчетнаяПолитика.МетодСписания;
    Запрос.Текст = СтрЗаменить(Запрос.Текст, "&УчетнаяПолитика", ?(УчетнаяПолитика = Перечисления.МетодыСписанияОстатков.FIFO, "ВОЗР", "УБЫВ"));
	
	РазультатыЗапросов = Запрос.ВыполнитьПакет();
	СписокНоменклатурныхПозицийДокумента = РазультатыЗапросов[1].Выгрузить();
	СписокОстатковТребуемыхТоваров = РазультатыЗапросов[2].Выгрузить();
	ИтогиПоТоварам = СписокОстатковТребуемыхТоваров.Скопировать(, "Товар, Остаток");
	ИтогиПоТоварам.Свернуть("Товар", "Остаток");
 	
	Движения.ОстаткиТоваров.Записывать = Истина; 
	Движения.Продажи.Записывать = Истина; 
	Для Каждого НоменклатурнаяПозиция Из СписокНоменклатурныхПозицийДокумента Цикл
		ДвижениеПродажи = Движения.Продажи.Добавить();
		ДвижениеПродажи.Период = Дата;
		ДвижениеПродажи.Номенклатура = НоменклатурнаяПозиция.Номенклатура;
		ДвижениеПродажи.Количество = НоменклатурнаяПозиция.Требуется;
		ДвижениеПродажи.Продажи = НоменклатурнаяПозиция.Сумма;
		
		Если НоменклатурнаяПозиция.ВидНоменклатуры = Перечисления.ВидыНоменклатуры.Услуга Тогда 
			Продолжить;	  
		КонецЕсли;  
		
		СтрТребуемыйТовар = ИтогиПоТоварам.Найти(НоменклатурнаяПозиция.Номенклатура, "Товар");
		Если Не ЗначениеЗаполнено(СтрТребуемыйТовар) Тогда
        	Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("Нет остатков для запрашиваемого товара %1", НоменклатурнаяПозиция.Номенклатура); 
			Сообщение.Сообщить();
			Отказ = Истина;
			Продолжить;
		КонецЕсли;
		ОстатокТовара = СтрТребуемыйТовар.Остаток;
		
		РазностьТребОст = НоменклатурнаяПозиция.Требуется - ОстатокТовара;                 
		Если РазностьТребОст > 0 Тогда  
        	Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("На складе не хватает %1 шт. товара %2", РазностьТребОст, НоменклатурнаяПозиция.Номенклатура); 
			Сообщение.Сообщить();
			Отказ = Истина;
			Продолжить; 
		КонецЕсли;
		
		Отбор = Новый Структура();
		Отбор.Вставить("Товар", НоменклатурнаяПозиция.Номенклатура); 
		СведенияПоВсемПартиям = СписокОстатковТребуемыхТоваров.НайтиСтроки(Отбор);
		Отбор.Вставить("Партия", НоменклатурнаяПозиция.Партия);
		
		ОтобранныеСтрокиСведенийПоЗаданнойПартии = СписокОстатковТребуемыхТоваров.НайтиСтроки(Отбор);
		Если ЗначениеЗаполнено(ОтобранныеСтрокиСведенийПоЗаданнойПартии) Тогда
			СтрСведенийПоЗаданнойПартии = СписокОстатковТребуемыхТоваров.НайтиСтроки(Отбор)[0]; // todo: можно же через Найти сделать раз я знаю что запись одна 
			СведенияПоВсемПартиям.Удалить(СведенияПоВсемПартиям.Найти(СтрСведенийПоЗаданнойПартии));
			СведенияПоВсемПартиям.Вставить(0, СтрСведенийПоЗаданнойПартии);
		КонецЕсли;
				
		ТребуетсяСписать = НоменклатурнаяПозиция.Требуется; 
		СуммарнаяСебестоимостьСписанного = 0;
		Для Каждого СтрСведенияОПартии Из СведенияПоВсемПартиям Цикл 
			СписаноСПартии = ТребуетсяСписать;
			СуммарнаяСебестоимостьСписанного = СтрСведенияОПартии.Себестоимость;
			Если Не СтрСведенияОПартии.Остаток = ТребуетсяСписать Тогда	
				СписаноСПартии = Мин(ТребуетсяСписать, СтрСведенияОПартии.Остаток);
				СтрСведенияОПартии.Остаток = СтрСведенияОПартии.Остаток - СписаноСПартии; 
				ТребуетсяСписать = ТребуетсяСписать - СписаноСПартии;    
				СуммарнаяСебестоимостьСписанного = СуммарнаяСебестоимостьСписанного + СписаноСПартии * СтрСведенияОПартии.Себестоимость / СтрСведенияОПартии.Остаток;
			КонецЕсли;
				
			ДвижениеОстатки = Движения.ОстаткиТоваров.Добавить();
			ДвижениеОстатки.ВидДвижения = ВидДвиженияНакопления.Расход;
			ДвижениеОстатки.Период = Дата;
			ДвижениеОстатки.Товар = СтрСведенияОПартии.Товар; 
			ДвижениеОстатки.Партия = СтрСведенияОПартии.Партия;
			ДвижениеОстатки.Количество = СписаноСПартии;	
			ДвижениеОстатки.Себестоимость = СуммарнаяСебестоимостьСписанного; 

			Если ТребуетсяСписать = 0 Тогда
			    Прервать;			
			КонецЕсли;
		КонецЦикла; 
			
		ДвижениеПродажи.Себестоимость = СуммарнаяСебестоимостьСписанного; 
	КонецЦикла;
КонецПроцедуры
