
Процедура ОбработкаПроведения(Отказ, Режим)
	Запрос = Новый Запрос("ВЫБРАТЬ
	                      |	ПродажаТоваровТовары.Товар КАК Товар,
	                      |	СУММА(ПродажаТоваровТовары.Количество) КАК Требуется,
	                      |	ПродажаТоваровТовары.Цена КАК Цена
	                      |ПОМЕСТИТЬ ВТ_СписокТоваров
	                      |ИЗ
	                      |	Документ.ПродажаТоваров.Товары КАК ПродажаТоваровТовары
	                      |ГДЕ
	                      |	ПродажаТоваровТовары.Ссылка = &Ссылка
	                      |
	                      |СГРУППИРОВАТЬ ПО
	                      |	ПродажаТоваровТовары.Товар,
	                      |	ПродажаТоваровТовары.Цена
	                      |;
	                      |
	                      |////////////////////////////////////////////////////////////////////////////////
	                      |ВЫБРАТЬ
	                      |	ВТ_СписокТоваров.Товар КАК Товар,
	                      |	ВТ_СписокТоваров.Требуется КАК Требуется,
	                      |	ОстаткиТоваровОстатки.КоличествоОстаток КАК Остаток,
	                      |	ВТ_СписокТоваров.Цена КАК Цена
	                      |ИЗ
	                      |	ВТ_СписокТоваров КАК ВТ_СписокТоваров
	                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрНакопления.ОстаткиТоваров.Остатки(
	                      |				&МоментВремени,
	                      |				Товар В
	                      |					(ВЫБРАТЬ
	                      |						ВТ.Товар
	                      |					ИЗ
	                      |						ВТ_СписокТоваров КАК ВТ)) КАК ОстаткиТоваровОстатки
	                      |		ПО ВТ_СписокТоваров.Товар = ОстаткиТоваровОстатки.Товар"); 
	
	Запрос.УстановитьПараметр("МоментВремени", МоментВремени());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Движения.ОстаткиТоваров.Записывать = Истина; 
	Движения.ПродажиТоваров.Записывать = Истина;
	Пока Выборка.Следующий() Цикл
		Если Выборка.Требуется > Выборка.Остаток Тогда
			Сообщение = Новый СообщениеПользователю;
			Сообщение.Текст = СтрШаблон("На складе не хватает %1 шт. товара %2", Выборка.Требуется - Выборка.Остаток, Выборка.Товар);
			Сообщение.Поле = Товары.Найти(Выборка.Товар, "Товар");
			Сообщение.Сообщить();
			Отказ = Истина;
			Продолжить;
		КонецЕсли;
		
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Товар = Выборка.Товар;
		Движение.Количество = Выборка.Требуется; 
		
		Движение = Движения.ПродажиТоваров.Добавить();
		Движение.Период = Дата;
		Движение.Товар = Выборка.Товар;
		Движение.Количество = Выборка.Требуется;
		Движение.Выручка = Выборка.Требуется * Выборка.Цена;
	КонецЦикла;
КонецПроцедуры
