
Процедура ОбработкаПроведения(Отказ, РежимПроведения)  
	Движения.ВзаиморасчетыСКлиентами.Очистить();
	Движения.ВзаиморасчетыСКлиентами.Записывать = Истина;
	Движения.ВзаиморасчетыСКлиентами.Записать();

	ДоговорАванса = Справочники.Договоры.ПолучитьДоговорАванса(Покупатель);
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ВзаиморасчетыСКлиентамиОстатки.СуммаОстаток КАК Остаток
	               |ИЗ
	               |	РегистрБухгалтерии.ВзаиморасчетыСКлиентами.Остатки(
	               |			&МоментВремени,
	               |			Счет = ЗНАЧЕНИЕ(ПланСчетов.Основной.Покупатели),
	               |			,
	               |			Субконто1 = &Контрагент
	               |				И Субконто2 = &ДоговорАванса) КАК ВзаиморасчетыСКлиентамиОстатки";
	ГраницаКонтроля = Новый Граница(МоментВремени(), ВидГраницы.Включая);
	Запрос.УстановитьПараметр("МоментВремени", ГраницаКонтроля);  
	Запрос.УстановитьПараметр("Контрагент", Покупатель);       
	Запрос.УстановитьПараметр("ДоговорАванса", ДоговорАванса);
	РезультатЗапроса = Запрос.Выполнить(); 
	
	Если Не РезультатЗапроса.Пустой() Тогда
		ДанныеАвансовогоСчета = РезультатЗапроса.Выбрать();  
		ДанныеАвансовогоСчета.Следующий();
		СуммаЗачтенногоАванса = Мин(Сумма, ДанныеАвансовогоСчета.Остаток);  
		Проводка = Движения.ВзаиморасчетыСКлиентами.Добавить();
		Проводка.Период = Дата;
		Проводка.СчетДт = ПланыСчетов.Основной.Покупатели; 
		Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоВзаиморасчетыСКлиентами.Договоры] = Договор;
		Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоВзаиморасчетыСКлиентами.Контрагенты] = Покупатель;   
		Проводка.СчетКт = ПланыСчетов.Основной.Покупатели;
		Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоВзаиморасчетыСКлиентами.Договоры] = ДоговорАванса;
		Проводка.СубконтоКт[ПланыВидовХарактеристик.ВидыСубконтоВзаиморасчетыСКлиентами.Контрагенты] = Покупатель; 
		Проводка.Сумма = СуммаЗачтенногоАванса;   
	КонецЕсли;   
	
	Проводка = Движения.ВзаиморасчетыСКлиентами.Добавить();
	Проводка.Период = Дата;
	Проводка.СчетДт = ПланыСчетов.Основной.Покупатели;
	Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоВзаиморасчетыСКлиентами.Договоры] = Договор;
	Проводка.СубконтоДт[ПланыВидовХарактеристик.ВидыСубконтоВзаиморасчетыСКлиентами.Контрагенты] = Покупатель;  
	Проводка.СчетКт = ПланыСчетов.Основной.ПрибылиИУбытки;  
	Проводка.Сумма = Сумма; 
КонецПроцедуры
